{"pageProps":{"frontmatter":{"id":2,"title":"SQL Cross Join","date":"May 8 2020"},"slug":"sql-cross-join","content":"<p>Let’s say we’re working in a database for a yet-to-be world-famous shoe company, named Shoe-pple. Shoe-pple is a bit of a peculiar company. Shoe-pple’s unique spin on shoes involves selling one type of shoe in almost any shade of colour possible.</p>\n<p>Our co-founder, Carl, is finally ready to launch the company’s first line of shoes, but first we need to list every shoe size and colour our manufacturer needs to make.</p>\n<p>We’ve got our planned shoe sizes stored in a database table named <code>sizes</code> and we also have our first set of colours stored in a database table named <code>shoe_colours</code>. We need to extract all of this data and then we need to create a list of every possible combination.</p>\n<p>Sounds tricky, but suddenly we remember that SQL Cross Joins can save the day!</p>\n<p>We can query all this information and then mix together all the possible combinations by making use of a SQL Cross Join, so let’s do it!</p>\n<p>We’ll assume our table <code>sizes</code> consists of 3 basic sizes: 6, 7, and 8.\nWe’ll also assume our table <code>shoe_colours</code> consists of 3 wonderful colours: lavender, maroon, and azure.</p>\n<p>Let’s build a cross join to mix every combination like so:</p>\n<pre><code class=\"language-sql\">SELECT sizes.size, shoe_colours.colour\nFROM sizes\nCROSS JOIN shoe_colours;\n</code></pre>\n<p>And BOOM! Our result:</p>\n<table>\n<thead>\n<tr>\n<th>size</th>\n<th>colour</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>6</td>\n<td>Lavender</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Maroon</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Azure</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Lavender</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Maroon</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Azure</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Lavender</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Maroon</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Azure</td>\n</tr>\n</tbody></table>\n<p>Pretty simple, right? Our example might be a little contrived. Our example is simple to do by hand, but given a larger list things could get a little more complicated.</p>\n<p>You can also create a cross join by doing something like this:</p>\n<pre><code class=\"language-sql\">SELECT sizes.size, shoe_colours.colour\nFROM sizes, shoe_colours;\n</code></pre>\n<p>So just a friendly heads up in case you ever see that in the wild.</p>\n<p>Now that Shoe-pple has our list, it’s time to begin its world shoe domination!</p>\n"},"__N_SSG":true}