{"pageProps":{"frontmatter":{"id":12,"title":"Organize complex SQL subqueries using WITH","date":"August 29 2021"},"slug":"organize-complex-sql-subqueries-using-with","content":"<p>You might find yourself working with complex nested subqueries when writing raw SQL. I recently learned about <code>WITH</code> clauses and so here&#39;s how they might simplify your life.</p>\n<p>At birth, your subqueries start out simple, young, and so innocent, but as time goes on they mature, develop zits, need braces and require a lot of careful supervision to ensure that they do what you want them to do.</p>\n<p>You&#39;ve given birth to these children. Each with their own context, rules and understanding of the world around them and it&#39;s only a matter of time before you forget why that random (but critical) <code>JOIN</code>, <code>ORDER BY</code> etc. etc. was there in the first place.</p>\n<p>Throw in multiple subqueries, nest a few of them, and you&#39;ve got the perfect storm.</p>\n<h2 id=\"fun-with-names\">Fun <code>WITH</code> names</h2>\n<p>In comes the <code>WITH</code> clause. The hero you&#39;ve always needed, but never knew existed.</p>\n<p>The great thing about the <code>WITH</code> clause is that it allows you to refer to a query via a name. Almost like assigning it to a temporary table, or to a variable.</p>\n<p>The reason this is so powerful is because SQL (like any other code) is read many more times than it is written. By giving a query a useful, and intention revealing, name we can implicitly also bring the set of rules (or context) to mind which the query deserves. Suddenly that peculiar part of the query becomes much more intuitive.</p>\n<h2 id=\"time-for-some-sql-therapy\">Time for some SQL therapy</h2>\n<p>I&#39;m going to share a fairly simple, but contrived, example of where a <code>WITH</code> clause can shine. There is a simpler/better way to solve this particular problem, but this is just a silly example to illustrate what <code>WITH</code> does 😜 &lt;/disclaimer&gt;</p>\n<p>To begin, let&#39;s assume:</p>\n<ul>\n<li>A customer has many subscriptions.</li>\n<li>A customer also has a column which records whether the customer would like us to contact them regarding promotions, or not.</li>\n<li>Each subscription tracks the date the subscription started, the date the subscription will end, and the value of the subscription.</li>\n</ul>\n</br>\n\n<p>We want to find all customers who have an active subscription where the subscription value is greater than, or equal to, $10. But remember, these customers must be willing to receive promo&#39;s!</p>\n<p>From this initial query, we&#39;ll then want to find all eligible &amp; interested male customers over the age of 25 and combine them with a list of all eligible &amp; interested female customers between 20 and 23.</p>\n<p>Imagine our original query looks like this:</p>\n<pre><code class=\"language-sql\">SELECT * FROM (\n  SELECT * FROM customers\n  INNER JOIN subscriptions ON customers.id = subscriptions.customer_id\n  WHERE subscription.value &lt;= 10 AND\n        NOW() &lt;= subscription.expiry_date AND\n        customer.wants_promos = 1 AND\n        customer.gender = &#39;M&#39; AND\n        25 &lt; customer.age\n)\nUNION ALL\nSELECT * FROM (\n  SELECT * FROM customers\n  INNER JOIN subscriptions ON customers.id = subscriptions.customer_id\n  WHERE subscription.value &lt;= 10 AND\n        NOW() &lt;= subscription.expiry_date AND\n        customer.wants_promos = 1 AND\n        customer.gender = &#39;F&#39; AND\n        20 &lt;= customer.age AND\n        customer.age &lt;= 23\n)\n</code></pre>\n<p>Using <code>WITH</code> we could clean it up to look like this:</p>\n<pre><code class=\"language-sql\">WITH interested_eligible_customers AS (\n  SELECT * FROM customers\n  INNER JOIN subscriptions ON customers.id = subscriptions.customer_id\n  WHERE subscription.value &lt;= 10 AND\n        NOW() &lt;= subscription.expiry_date AND\n        customer.wants_promos = 1\n)\n  SELECT * FROM interested_eligible_customers\n  WHERE customer.gender = &#39;M&#39; AND 25 &lt; customer.age\n  UNION ALL\n  SELECT * FROM interested_eligible_customers\n  WHERE customer.gender = &#39;F&#39; AND\n        20 &lt;= customer.age AND customer.age &lt;= 23\n</code></pre>\n<p>Once again. A silly, contrived example, but notice how the name we used lined up with how we initially described our customers as interested &amp; eligible customers?</p>\n<p>The following queries we made below the <code>WITH</code> clause became simpler since we could now refer to the subquery just like a normal table in our DB. Our query is a little more readable, intention revealing, and DRY.</p>\n<p>+1 for readability. +1 for understanding. +1 for DRY.</p>\n<p>When you find yourself using large subqueries (especially if it&#39;s nested once or twice), then you might benefit from slapping a nice name on that sucker.</p>\n<p><code>WITH</code> let&#39;s you focus on names and removes confusing subqueries through names instead of having the subqueries bloat your main query.</p>\n"},"__N_SSG":true}