{"pageProps":{"frontmatter":{"id":11,"title":"Communication Between Angular Components","date":"June 29 2020"},"slug":"communication-between-angular-components","content":"<p>I thought I could go through how to hook Angular components to each other so they can listen to each other listen for specific events. Angular components are able to receive a set of inputs, by decorating properties of the class with the <code>@Input</code> decorator, likewise we can set the outputs of a particular component using the <code>@Output</code> decorator.</p>\n<p>Let’s imagine we’re making a simple party app where we have two components in our app. The one has a button, which when clicked emits a party event. When this event is raised, our second component needs to flash the appropriate message, so we all know what to do.</p>\n<p>The one component (let’s call it our <code>PartyButtonComponent</code>) is the component which displays the appropriate button. It needs to raise an event, when the button is clicked.\nIts controller will look like this:</p>\n<pre><code class=\"language-javascript\">import { Component, Output, EventEmitter } from &#39;@angular/core&#39;;\n\n@Component({\n  selector: &#39;party-button&#39;,\n  templateUrl: &#39;./party-button.component.html&#39;,\n  styleUrls: [&#39;./party-button.component.css&#39;]\n})\nexport class PartyButtonComponent  {\n  @Output() onParty: EventEmitter&lt;null&gt; = new EventEmitter&lt;null&gt;();\n\n  party() {\n    this.onParty.emit();\n  }\n}\n</code></pre>\n<p>And its template will look something like this:</p>\n<pre><code class=\"language-html\">&lt;button class=&quot;btn btn-success&quot; type=&quot;button&quot; (click)=&quot;party()&quot;&gt;Party!&lt;/button&gt;\n</code></pre>\n<p>Here we’ve created our party button component. We’ve created an <code>onParty</code> output, which uses an Angular Event Emitter so that Angular can pick up on our events and initiate change detection.</p>\n<p>The button in our template will emit the <code>onParty</code> event, when the <code>party</code> method is called by clicking the button.</p>\n<p>Now, in order for our second component (which we’ll call the <code>PartyTextComponent</code>) to detect this event, it needs to listen to the <code>PartyButtonComponent</code>’s <code>onParty</code> event. We can do this like so:</p>\n<pre><code class=\"language-html\">&lt;party-button (onParty)=&quot;text.showPartyText()&quot;&gt;&lt;/party-button&gt;\n&lt;party-text #text&gt;&lt;/party-text&gt;\n</code></pre>\n<p>Here we’ve defined our <code>PartyButtonComponent</code> and our <code>PartyTextComponent</code>. We’ve then defined a template variable called <code>text</code>, this creates a reference to <code>PartyTextComponent</code> which we can then use to call its <code>showPartyText()</code> method when the <code>onParty()</code> event is emitted from our <code>PartyButtonComponent</code>.</p>\n<pre><code class=\"language-javascript\">import { Component } from &#39;@angular/core&#39;;\n\n@Component({\n  selector: &#39;party-text&#39;,\n  templateUrl: &#39;./party-text.component.html&#39;,\n  styleUrls: [&#39;./party-text.component.css&#39;]\n})\nexport class PartyTextComponent  {\n  private showText: Boolean = false;\n\n  showPartyText () {\n    this.showText = !this.showText;\n  }\n}\n</code></pre>\n<p>Here our <code>PartyTextComponent</code> is just keeping track of some state which will control whether, or not, the party text should be displayed. I’ll omit the template for this component since a simple directive is all you need to get this working.</p>\n<p>But that’s essentially it. This is a great way to allow components to listen to each other. The downside to this approach is that this method only allows us to have components communicate with each other in the template using template variables.</p>\n<p>There is a way to bring this code into the controllers of our components, but I’ll leave that for another blog.</p>\n"},"__N_SSG":true}