{"pageProps":{"frontmatter":{"id":4,"title":"SQL Views","date":"May 10 2020"},"slug":"sql-views","content":"<p>The more I learn about SQL the more I realize that there’s a million different ways to query the same data, but sometimes you actually just want to use the same query over and over again to get some useful information.</p>\n<p>SQL views are the perfect way to ensure that you aren’t copying and pasting the same verbose SQL statement over and over again just to query data from your database.</p>\n<p>A view is essentially a SQL statement which has been saved to create a type of in memory database. It’s super handy since it can take a complicated query and break it down so that you have time to focus on what matters most. There are so caveats though, no solution is perfect. Let’s dive in and learn about SQL views!</p>\n<h2 id=\"creating-a-sql-view\">Creating a SQL View</h2>\n<p>Let’s imagine we have a table called <code>suppliers</code> which tracks various information about the suppliers a business uses to get resources to perform various projects.</p>\n<p>If, for example, our business found that we kept performing the same sort of query where we want to find all suppliers where the amount of money spent on that supplier exceeded some threshold, then we could save ourselves some time by creating a SQL view like so:</p>\n<pre><code class=\"language-sql\">CREATE VIEW useful_suppliers AS\nSELECT name, address, amount_spent\nFROM suppliers\nWHERE 1000 &lt; amount_spent;\n</code></pre>\n<p>Now, instead of having to write the same select query a million times, we have it saved in our SQL db as a view which we can query like a table.</p>\n<h2 id=\"querying-data-from-a-sql-view\">Querying data from a SQL View</h2>\n<p>We can query a view much like any other SQL table.</p>\n<pre><code class=\"language-sql\">SELECT SUM(amount_spent) AS total_spent\nFROM useful_suppliers;\n</code></pre>\n<p>Inserting/updating data into a view is a little trickier since there are certain conditions which dictate when this is possible.</p>\n<p>For example, it’s possible to update our view based on the following rules:</p>\n<ol>\n<li>Our query does not use the DISTINCT keyword.</li>\n<li>Our query does not use any summary function or set functions/operators.</li>\n<li>Our query does not use the ORDER BY clause.</li>\n<li>Our query does not join multiple tables.</li>\n<li>Our query does not use a WHERE clause containing subqueries.</li>\n<li>Our query does not use the GROUP BY or HAVING clauses.</li>\n</ol>\n<p>Provided we follow these rules, we can insert/update our view like anything else in SQL:</p>\n<pre><code class=\"language-sql\">INSERT INTO useful_suppliers (name, address, amount_spent)\nVALUES (‘Tools R Us’, ‘123 Sesame Road’, 1200);\n</code></pre>\n<p>And likewise delete anything:</p>\n<pre><code class=\"language-sql\">DELETE FROM useful_suppliers\nWHERE name = ‘Tools R Us’;\n</code></pre>\n<p>This does not mean that we cannot create a view which breaks these rules, but it just means that if we do break these rules, then we can no longer update the values directly using our view.</p>\n<h2 id=\"changingreplacing-a-sql-view\">Changing/replacing a SQL View</h2>\n<p>We can also change a view we’ve created if our requirements ever change.</p>\n<pre><code class=\"language-sql\">REPLACE VIEW useful_suppliers\nSELECT name, amount_spent\nFROM suppliers\nWHERE 9999 &lt; amount_spent;\n</code></pre>\n<h2 id=\"deleting-a-sql-view\">Deleting a SQL view</h2>\n<p>We can also get rid of views which we don’t need. It’s much like dropping any normal table in SQL.</p>\n<pre><code class=\"language-sql\">DROP VIEW useful_customers;\n</code></pre>\n<p>I hope this crash course on views has been insightful. I’ve had the unfortunate opportunity to have to come back to a database every few months, or so, just to perform the same painful and difficult-to-remember query.</p>\n<p>So, I was relieved to hear that such a thing existed in SQL. Next time you find yourself with the same issue, try to save yourself the pain and consider using a view!</p>\n"},"__N_SSG":true}