{"pageProps":{"frontmatter":{"id":7,"title":"SQL Triggers","date":"May 20 2020"},"slug":"sql-triggers","content":"<p>SQL triggers are essentially blocks of code which get automatically executed before (or after) insert, update, or delete statements. They’re super handy for things like ensuring data consistency, but in today’s example we’re gonna show how triggers can be a useful auditing tool.</p>\n<p>Let’s say we have an app where users can create blogs posts. Users have the ability to create, edit and delete posts, but sometimes some users’ posts contain random changes which they swear they never added. We decide to create audit logs to track some of the changes made to the posts, like updating a blog post for example.</p>\n<p>To start things, lets imagine we have an audits table with the following info</p>\n<table>\n<thead>\n<tr>\n<th>post_audits</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>user_id</td>\n</tr>\n<tr>\n<td>post_id</td>\n</tr>\n<tr>\n<td>date</td>\n</tr>\n</tbody></table>\n<p>We’ll also imagine that our blog post table stores the user who last updated the post.</p>\n<h2 id=\"creating-a-sql-trigger\">Creating a SQL trigger</h2>\n<p>To begin, we create a SQL trigger like this:</p>\n<pre><code class=\"language-sql\">DELIMITER $$\n\nCREATE TRIGGER posts_after_update\n  AFTER UPDATE ON posts\n  FOR EACH ROW\nBEGIN\n  INSERT INTO post_audits\n  VALUES(\n    NEW.client_id,\n    NEW.post_id,\n    NEW.last_modified_user_id,\n    NOW()\n  );\nEND$$\n\nDELIMITER ;\n</code></pre>\n<p>I’m going to skip over some of the code that’s common with creating a stored procedure. If something is missing then be sure to check out post #5.</p>\n<p>In this case we’ve created a trigger with a descriptive name which helps us know when this trigger is fired.</p>\n<p>We can create triggers whenever data inside a table is inserted, deleted or updated. We can select whether we’d like this trigger to execute before or after the event has occurred. In this case our trigger fires after an update on the posts table, but we could change it to fire before by replacing <code>AFTER</code> with <code>BEFORE</code>.</p>\n<p>We then state that for every row changed, create a row in the <code>post_audits</code> table.</p>\n<p>The body of our trigger inserts some of the post data into our <code>post_audits</code> table. In this instance, we’re interested in the updated values of the record being updated, so we refer to it using <code>NEW</code> followed by a <code>.</code> and the name of the field we’d like to get.</p>\n<p>We can also refer to the old instance of the record using <code>OLD</code>.</p>\n<p>But just like that we’re able to see what changes have been made for a particular post, but inspecting our <code>post_audits</code> table. Neat, right?</p>\n<h2 id=\"viewing-triggers\">Viewing triggers</h2>\n<p>We can see all of our triggers with:</p>\n<pre><code class=\"language-sql\">SHOW TRIGGERS;\n</code></pre>\n<p>This will show us all sorts of useful info like the trigger’s name, the event which will cause it to fire, the table the trigger is set to watch, the actual trigger code, whether it’s a before/after trigger and more.</p>\n<p>In some cases, you might have quite a few triggers, so don’t forget that you can slap a <code>LIKE</code> on the end of that bad boy and filter the results.</p>\n<h2 id=\"dropping-triggers\">Dropping triggers</h2>\n<p>Dropping triggers is similar to dropping stored procedures.</p>\n<pre><code class=\"language-sql\">DROP TRIGGER payments_after_insert;\n</code></pre>\n<p>And that’s it! I hope this post audits example was a useful proof of concept for what can be down with triggers. I really liked it and might consider using it the next time I need to audit key data.</p>\n"},"__N_SSG":true}