{"pageProps":{"frontmatter":{"id":9,"title":"SQL Transactions","date":"May 23 2020"},"slug":"sql-transactions","content":"<p>A transaction is a group of SQL statements which represent a single unit of work. So, all of the statements inside the transaction must be completed successfully or else the transaction will fail.</p>\n<p>A prime example could be a bank transaction. We’d have a problem if the withdrawal was successful, but the deposit never occurred. We’ve just lost money! Both events must be successful for the transaction to be complete.</p>\n<p>There are 4 key properties (ACID) of a good transaction:</p>\n<p>Atomicity: All statements are performed as one operation. They must all be successful, or else the transaction has failed. Think all or nothing.</p>\n<p>Consistency: The data must be consistent when a transaction starts and finishes. Like a bank transaction, we have not lost, or created, any extra money. The amount of funds is consistent.</p>\n<p>Isolation: Transactions are isolated from each other if they try to update the same data. Transactions are queued up to run one by one.</p>\n<p>Durability: The changes made by a transaction must persist if the transaction is successful. The changes must not be lost.</p>\n<h2 id=\"creating-a-transaction\">Creating a transaction:</h2>\n<pre><code class=\"language-sql\">START TRANSACTION;\n\nINSERT INTO users (points)\nVALUES (100);\n\nCOMMIT;\n</code></pre>\n<p>This is fairly simple example, but the point is clear. We just have to wrap our SQL statements with <code>START TRANSACTION</code> and <code>COMMIT</code>.</p>\n<h2 id=\"concurrency\">Concurrency:</h2>\n<p>So, when working with transactions, it’s possible that two, or more, transactions might attempt to retrieve, or change, fields on one row in a database table. Because of this possibility we have some potential concurrency headaches we have to take note of:</p>\n<h3 id=\"lost-updates\">Lost updates:</h3>\n<p>This is when two transactions try to update the same row. The transaction that commits last will overwrite the changes the first transaction committed thus losing any updates which the first made.</p>\n<p>Imagine having a users table which tracks things like the users name and age.\nWe might have a user like this:</p>\n<table>\n<thead>\n<tr>\n<th>name</th>\n<th>age</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Abe</td>\n<td>20</td>\n</tr>\n</tbody></table>\n<p>Transaction A updates the name like this:</p>\n<table>\n<thead>\n<tr>\n<th>name</th>\n<th>age</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Abraham</td>\n<td>20</td>\n</tr>\n</tbody></table>\n<p>But whilst this is happening, transaction B comes along and updates the age:</p>\n<table>\n<thead>\n<tr>\n<th>name</th>\n<th>age</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Abe</td>\n<td>21</td>\n</tr>\n</tbody></table>\n<p>Not good! We’ve lost some data!</p>\n<h3 id=\"dirty-reads\">Dirty reads:</h3>\n<p>This occurs when we have a transaction which reads data which hasn’t yet been committed.</p>\n<p>For example, transaction A is updating points belonging to a user. We then have transaction B do a calculation using points, and it reads the points which transaction A has set (but transaction A has not yet finished and committed its change). For some reason, transaction A fails and rolls back the value of the users’ points. The issue here is that transaction B might be using a value for points which is invalid, or which no longer exists (yet).</p>\n<h3 id=\"non-repeating-reads\">Non-repeating reads:</h3>\n<p>This is where data is read at two different times in one transaction, but the value has changed each time. For example, with the points. This might sound similar to dirty reads, but here’s the difference: We could be reading values which have been successfully committed.</p>\n<p>So essentially, we want the points to remain constant/consistent in the transaction.</p>\n<p>Imagine if transaction A queried points multiple times in a transaction, but transaction B came along and made a quick change to the points for the same user. Imagine trying to debug or recalculate that. Yikes!</p>\n<h3 id=\"phantom-reads\">Phantom reads:</h3>\n<p>This sort of issue occurs where we have transaction A which queries a table based on a certain criterion, let’s say where points are greater than ten, but then right afterwards transaction B updates a user to have enough points to match the criteria.</p>\n<p>In some cases, it might be critical to ensure that we don’t have anyone excluded from some queries we’ve made.\nIn this case, the solution would be to track and wait for transactions which to finish which could potentially cause phantom reads.</p>\n<p>So how do we solve these issues?</p>\n<p>Luckily SQL has ways for transactions to overcome these issues using isolation levels. The following table shows the isolation level in the first column and what the isolation solves, marked with an ‘X’:</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Lost Updates</th>\n<th>Dirty Reads</th>\n<th>Non-Repeating Reads</th>\n<th>Phantom Reads</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>READ UNCOMMITTED</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>READ COMMITTED</td>\n<td></td>\n<td>X</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>REPEATABLE READ</td>\n<td>X</td>\n<td>X</td>\n<td>X</td>\n<td></td>\n</tr>\n<tr>\n<td>SERIALIZABLE</td>\n<td>X</td>\n<td>X</td>\n<td>X</td>\n<td>X</td>\n</tr>\n</tbody></table>\n<p>As we move from <code>READ UNCOMMITTED</code> to <code>SERIALIZABLE</code> we’re increasing our isolation level (and vice versa) which means that we are solving more of our concurrency issues.</p>\n<p>Not all databases need the highest level of isolation, and one has to find the right balance of isolation vs performance. Increasing the level of isolation can slow down our transactions since we have to add locks and do things like wait for other transaction to finish etc.</p>\n<p>By default, MySQL’s transaction isolation level is set to <code>REPEATABLE READ</code>.</p>\n<h2 id=\"viewing-our-isolation-level\">Viewing our isolation level:</h2>\n<p>You can see your isolation level like this:</p>\n<pre><code class=\"language-sql\">SHOW VARIABLES LIKE ‘transaction_isolation’;\n</code></pre>\n<h2 id=\"setting-our-isolation-level\">Setting our isolation level:</h2>\n<p>We can set our isolation level to something different like this:</p>\n<pre><code class=\"language-sql\">SET TRANSACTION ISOLATION LEVEL SERIALIZABLE;\n</code></pre>\n<p>However, this will only set the isolation level for the next transaction run. We can set it for all transaction in our session/connection like so:</p>\n<pre><code class=\"language-sql\">SET SESSION TRANSACTION ISOLATION LEVEL SERIALIZABLE;\n</code></pre>\n<p>And finally, we can also set it globally for all sessions:</p>\n<pre><code class=\"language-sql\">SET GLOBAL TRANSACTION ISOLATION LEVEL SERIALIZABLE;\n</code></pre>\n<h2 id=\"deadlocks\">Deadlocks:</h2>\n<p>So, deadlocks really suck. I’ve had some bad experiences with them in the past, but they occur when different transactions cannot complete because each transaction has a lock on a row which the other transaction needs to access.</p>\n<p>For example:</p>\n<p>Transaction A</p>\n<pre><code class=\"language-sql\">START TRANSACTION;\n\nUPDATE customers SET state = ‘VA’ where customer_id = 1;\nUPDATE orders SET status = 1 WHERE order_id = 1;\n\nCOMMIT;\n</code></pre>\n<p>Transaction B</p>\n<pre><code class=\"language-sql\">START TRANSACTION;\n\nUPDATE orders SET status = 1 WHERE order_id = 1;\nUPDATE customers SET state = ‘VA’ where customer_id = 1;\n\nCOMMIT;\n</code></pre>\n<p>Both transactions could be run at roughly the same time, and a deadlock occurs because are waiting on each other. Transaction A needs the same orders row which transaction B is using, and transaction B is using the same customers row which transaction A needs.</p>\n<p>It can be a little difficult to deal with deadlocks, but we can keep an eye open for them when we write our queries. There are also strategies we can use to minimize this, like keeping our transactions as small as possible so that they complete as quick as possible (reducing the chance that the deadlock occurs), but that might be a topic for another day’s blog.</p>\n"},"__N_SSG":true}